# HasLargeSketches Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..HasLargeSketches Method
Family Class See Also
---
Checks whether the family contains sketches with a large number of elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool HasLargeSketches()
```

Visual Basic
---
```text
Public Function HasLargeSketches As Boolean
```

Visual C++
---
```text
public:
bool HasLargeSketches()
```

# Remarks
Families containing large sketches (typically with 300+ elements) may cause performance problems in parametric families (see IsParametric). Thus, before adding any constraints to a family (which will make the family parametric,) this method can be queried and the decision about whether the family should indeed be turned parametric may be deferred to the end-user.
# See Also
Family Class
Autodesk.Revit.DB Namespace